// Задача 13: Напишите программу, которая выводит третью цифру заданного числа 
// или сообщает, что третьей цифры нет.

// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

Console.Clear();
Console.Write("Введите произвольное число: ");
int number = int.Parse(Console.ReadLine()!);
if(number < 100)
{
    Console.Write("Число имеет менее трех знаков, третьей цифры нет");
}
else
{
while (number > 999)
 {
    number = number / 10;
 }
 Console.Write($"Третья цифра числа: {number % 10}");
}

 