// Задача 10: Напишите программу, которая принимает на вход трёхзначное число
// и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

Console.Clear();
Console.Write("Введите число: ");
int number = int.Parse(Console.ReadLine()!);
if (number < 100 || number > 1000)
{
    Console.Write("Число не трехзначное, вводные данные не корректны");
}
else
{
    Console.Write($"Вторая цифра числа {number / 10 % 10}");
}